Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-GC_DFP/1.0.131/PIC32CK-GC01/svd/PIC32CK2051GC01100.svd
            <register>
               <name>ID_PFR0</name>
               <description>Processor Feature Register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000030</resetValue>
               <fields>
                  <field>
                     <name>State0</name>
                     <description>State two, A32 instruction set support</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>State1</name>
                     <description>State one, T32 instruction set support</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_PFR1</name>
               <description>Processor Feature Register 1</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000200</resetValue>
               <fields>
                  <field>
                     <name>Security</name>
                     <description>Security Extension implemented</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>MProgMod</name>
                     <description>M programmer's model</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_DFR0</name>
               <description>Debug Feature Register 0</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00200000</resetValue>
               <fields>
                  <field>
                     <name>MProgDbg</name>
                     <description>M-profile debug</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_AFR0</name>
               <description>Auxiliary Feature Register 0</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>IMPDEF0</name>
                     <description>Implementation defined feature 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IMPDEF1</name>
                     <description>Implementation defined feature 1</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IMPDEF2</name>
                     <description>Implementation defined feature 2</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>IMPDEF3</name>
                     <description>Implementation defined feature 3</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_MMFR0</name>
               <description>Memory Model Feature Register 0</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PMSA</name>
                     <description>Protected Memory System Architecture</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>OuterShr</name>
                     <description>Outermost Shareability</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>ShareLvl</name>
                     <description>Shareability Levels</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TCM</name>
                     <description>Tightly Coupled Memories</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>AuxReg</name>
                     <description>Auxiliary Registers</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_MMFR1</name>
               <description>Memory Model Feature Register 1</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
            </register>
            <register>
               <name>ID_MMFR2</name>
               <description>Memory Model Feature Register 2</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WFIStall</name>
                     <description>Wait For Interrupt stalling</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_MMFR3</name>
               <description>Memory Model Feature Register 3</description>
               <addressOffset>0x5C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CMaintVA</name>
                     <description>Cache maintenance by address</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CMaintSW</name>
                     <description>Cache maintenance set/way</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>BPMaint</name>
                     <description>Branch predictor maintenance</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_ISAR0</name>
               <description>Instruction Set Attribute Register 0</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x01101110</resetValue>
               <fields>
                  <field>
                     <name>BitCount</name>
                     <description>Bit count instructions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BitCountSelect</name>
                        <enumeratedValue>
                           <name>CLZ</name>
                           <description>CLZ supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>BitField</name>
                     <description>Bit field instructions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>BitFieldSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>BFC, BFI, SBFX, and UBFX supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CmpBranch</name>
                     <description>Compare and Branch instructions</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CmpBranchSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>CBNZ and CBZ supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Coproc</name>
                     <description>Coprocessor instructions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>CoprocSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>Only FPU coprocessor instructions</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Coprocessor instructions supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Debug</name>
                     <description>Debug instructions</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>DebugSelect</name>
                        <enumeratedValue>
                           <name>BKPT</name>
                           <description>BKPT supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Divide</name>
                     <description>Divide instructions</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>DivideSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SDIC and UDIV supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_ISAR1</name>
               <description>Instruction Set Attribute Register 1</description>
               <addressOffset>0x64</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x02211000</resetValue>
               <fields>
                  <field>
                     <name>Extend</name>
                     <description>Extend instructions</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>ExtendSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SXTB, SXTH, UXTB, UXTH supported</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSP</name>
                           <description>SXTB16, SXTAB, SXTAB16, SXTAH, UXTB16, iUXTAB, UXTAB16, and UXTAH supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>IfThen</name>
                     <description>If-Then instructions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>IfThenSelect</name>
                        <enumeratedValue>
                           <name>IT</name>
                           <description>IT supported</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Immediate</name>
                     <description>Data-processing instructions with long immediates</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>ImmediateSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>ADDW, MOVW, MOVT, and SUBW supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Interwork</name>
                     <description>Interworking instructions</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>InterworkSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>BLX, BX, and loads to PC supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ID_ISAR2</name>
               <description>Instruction Set Attribute Register 2</description>
               <addressOffset>0x68</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x20112032</resetValue>
               <fields>
                  <field>
                     <name>LoadStore</name>
                     <description>Additional load/store instructions</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>LoadStoreSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>Load-acquire, store-release, and exclusive load and store supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MemHint</name>
                     <description>Memory hint instructions</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MemHintSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>PLI and PLD supported</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MultiAccessInt</name>
                     <description>Interruptible multi-access instructions</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MultiAccessIntSelect</name>
                        <enumeratedValue>
                           <name>NO</name>
                           <description>LDM and STM are not interruptible</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESTART</name>
                           <description>LDM and STM are restartable</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>CONTINUE</name>
                           <description>LDM and STM are continuable</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Mult</name>
                     <description>Additional Multiply instructions</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MultSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>MUL, MLA, and MLS supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MultS</name>
                     <description>Advanced signed Multiply instructions</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MultSSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>SMULL and SMLAL supported</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DSP</name>
                           <description>All saturating and DSP signed multiplies supported</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MultU</name>
                     <description>Advanced unsigned Multiply instructions</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MultUSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>UMULL and UMLAL supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>Reversal</name>
                     <description>Reversal instructions</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>ReversalSelect</name>
                        <enumeratedValue>
                           <name>YES</name>
                           <description>REV, REV16, REVSH, and RBIT supported</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
